content/man/man1/git-http-fetch.1.org
#+TITLE: Manpages - git-http-fetch.1
* NAME
git-http-fetch - Download from a remote Git repository via HTTP

* SYNOPSIS
#+begin_example
git http-fetch [-c] [-t] [-a] [-d] [-v] [-w <filename>] [--recover] [--stdin | --packfile=<hash> | <commit>] <URL>
#+end_example

* DESCRIPTION
Downloads a remote Git repository via HTTP.

This command always gets all objects. Historically, there were three
options *-a*, *-c* and *-t* for choosing which objects to download. They
are now silently ignored.

* OPTIONS
commit-id

#+begin_quote
Either the hash or the filename under [URL]/refs/ to pull.

#+end_quote

-a, -c, -t

#+begin_quote
These options are ignored for historical reasons.

#+end_quote

-v

#+begin_quote
Report what is downloaded.

#+end_quote

-w <filename>

#+begin_quote
Writes the commit-id into the specified filename under
$GIT_DIR/refs/<filename> on the local end after the transfer is
complete.

#+end_quote

--stdin

#+begin_quote
Instead of a commit id on the command line (which is not expected in
this case), /git http-fetch/ expects lines on stdin in the format

#+begin_quote
#+begin_example
<commit-id>[\t<filename-as-in--w>]
#+end_example

#+end_quote

#+end_quote

--packfile=<hash>

#+begin_quote
For internal use only. Instead of a commit id on the command line (which
is not expected in this case), /git http-fetch/ fetches the packfile
directly at the given URL and uses index-pack to generate corresponding
.idx and .keep files. The hash is used to determine the name of the
temporary file and is arbitrary. The output of index-pack is printed to
stdout. Requires --index-pack-args.

#+end_quote

--index-pack-args=<args>

#+begin_quote
For internal use only. The command to run on the contents of the
downloaded pack. Arguments are URL-encoded separated by spaces.

#+end_quote

--recover

#+begin_quote
Verify that everything reachable from target is fetched. Used after an
earlier fetch is interrupted.

#+end_quote

* GIT
Part of the *git*(1) suite
